# Дан список имен.
# Выведите все имена в одну строку через запятую

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]
i = 1
s = names[0]

while i < len(names):
    s += ", "+names[i]
    i += 1
print(s)

# Пример вывода:
# Иван, Ирина, Вячеслав, Василий, Петр
